It seems like 4 are made

```
                     # module.alternat.aws_eip.nat_gateway_eips["us-west-2a"] will be created
                     + resource "aws_eip" "nat_gateway_eips" {
                         + allocation_id        = (known after apply)
                         + arn                  = (known after apply)
                         + association_id       = (known after apply)
                         + carrier_ip           = (known after apply)
                         + customer_owned_ip    = (known after apply)
                         + domain               = (known after apply)
                         + id                   = (known after apply)
                         + instance             = (known after apply)
                         + network_border_group = (known after apply)
                         + network_interface    = (known after apply)
goldsky-infra-dev  + private_dns          = (known after apply)
                         + private_ip           = (known after apply)
                         + ptr_record           = (known after apply)
                         + public_dns           = (known after apply)
                         + public_ip            = (known after apply)
                         + public_ipv4_pool     = (known after apply)
                         + tags                 = {
                             + "Name" = "alternat-gateway-eip"
                           }
                         + tags_all             = {
                             + "Name"         = "alternat-gateway-eip"
                             + "map-migrated" = "mig48715"
                           }
                         + vpc                  = (known after apply)
                       }

                     # module.alternat.aws_eip.nat_gateway_eips["us-west-2b"] will be created
                     + resource "aws_eip" "nat_gateway_eips" {
                         + allocation_id        = (known after apply)
                         + arn                  = (known after apply)
goldsky-infra-dev  + association_id       = (known after apply)
                         + carrier_ip           = (known after apply)
                         + customer_owned_ip    = (known after apply)
                         + domain               = (known after apply)
                         + id                   = (known after apply)
                         + instance             = (known after apply)
                         + network_border_group = (known after apply)
                         + network_interface    = (known after apply)
                         + private_dns          = (known after apply)
                         + private_ip           = (known after apply)
                         + ptr_record           = (known after apply)
                         + public_dns           = (known after apply)
                         + public_ip            = (known after apply)
                         + public_ipv4_pool     = (known after apply)
                         + tags                 = {
                             + "Name" = "alternat-gateway-eip"
                           }
goldsky-infra-dev  + tags_all             = {
                             + "Name"         = "alternat-gateway-eip"
                             + "map-migrated" = "mig48715"
                           }
                         + vpc                  = (known after apply)
                       }

                     # module.alternat.aws_eip.nat_instance_eips[0] will be created
                     + resource "aws_eip" "nat_instance_eips" {
                         + allocation_id        = (known after apply)
                         + arn                  = (known after apply)
                         + association_id       = (known after apply)
                         + carrier_ip           = (known after apply)
                         + customer_owned_ip    = (known after apply)
                         + domain               = (known after apply)
                         + id                   = (known after apply)
                         + instance             = (known after apply)
                         + network_border_group = (known after apply)
goldsky-infra-dev  + network_interface    = (known after apply)
                         + private_dns          = (known after apply)
                         + private_ip           = (known after apply)
                         + ptr_record           = (known after apply)
                         + public_dns           = (known after apply)
                         + public_ip            = (known after apply)
                         + public_ipv4_pool     = (known after apply)
                         + tags                 = {
                             + "Name" = "alternat-instance-0"
                           }
                         + tags_all             = {
                             + "Name"         = "alternat-instance-0"
                             + "map-migrated" = "mig48715"
                           }
                         + vpc                  = (known after apply)
                       }

                     # module.alternat.aws_eip.nat_instance_eips[1] will be created
                     + resource "aws_eip" "nat_instance_eips" {
                         + allocation_id        = (known after apply)
goldsky-infra-dev  + arn                  = (known after apply)
                         + association_id       = (known after apply)
                         + carrier_ip           = (known after apply)
                         + customer_owned_ip    = (known after apply)
                         + domain               = (known after apply)
                         + id                   = (known after apply)
                         + instance             = (known after apply)
                         + network_border_group = (known after apply)
                         + network_interface    = (known after apply)
                         + private_dns          = (known after apply)
                         + private_ip           = (known after apply)
                         + ptr_record           = (known after apply)
                         + public_dns           = (known after apply)
                         + public_ip            = (known after apply)
                         + public_ipv4_pool     = (known after apply)
                         + tags                 = {
                             + "Name" = "alternat-instance-1"
goldsky-infra-dev  }
                         + tags_all             = {
                             + "Name"         = "alternat-instance-1"
                             + "map-migrated" = "mig48715"
                           }
                         + vpc                  = (known after apply)
                       }
```